
import streamlit as st
import pandas as pd
from sklearn.linear_model import LinearRegression

st.header('Healthy With Me')
tab1, tab2, tab3 = st.tabs(["HOME", "BMI", "CALORIES"])
with tab1:
    st.markdown('#### Exercise is importance for your life ')
    st.markdown('###  ')
    st.write(' การออกกำลังกาย เป็นกิจกรรมทางกายใด ๆ ก็ได้ที่เสริมหรือคงสภาพสมรรถภาพทางกาย '
             'ความแข็งแรงและสุขภาพทั่วไปของร่างกายอาจทำเพราะเหตุต่างๆรวมทั้งเพื่อเสริมการเติบโตและพัฒนาการของร่างกาย '
             'ป้องกันไม่ให้แก่เร็ว เสริมสร้างความแข็งแรงของกล้ามเนื้อและระบบไหลเวียนโลหิต ปรับปรุงทักษะทางกีฬา ลดหรือรักษาน้ำหนัก และเพื่อความสนุก'
             'การออกกำลังกายอย่างสม่ำเสมอจะช่วยสร้างเสริมระบบภูมิคุ้มกันและช่วยป้องกันโรคต่างๆ เช่นโรคหัวใจร่วมหลอดเลือด เบาหวาน และโรคอ้วน'
             'หลายๆคนเลือกออกกำลังกายนอกบ้านที่ทำเป็นกลุ่มเพื่อสังสรรค์และเพื่อความสุข การออกกำลังกายยังช่วยสร้างเสริมสุขภาพจิตและลดความเครียดได้')
    st.image("https://th.bing.com/th/id/OIP.KHMYTDtCBME4_42_NPOOLQHaFJ?w=233&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7", width=500)

st.sidebar.image('https://www.workoutwithtasha.co.uk/wp-content/uploads/2020/12/128388861_1618979168311711_2740554773629272354_n-1.jpg')
st.sidebar.title('Choose the organ')


lab1, lab2, lab3, lab4, lab5 = st.sidebar.tabs(["ARM", "BACK", "CHEST", "ABS", "LEG"])
#---------- Arm --------------------------------------------------------------------------------------------------------
with lab1:
    front_arm = st.button('Front Arm')
    behind_arm = st.button('Behind Arm')
if front_arm:
    st.markdown('## กล้ามเนื้อแขน(Arm)')
    r = st.columns(4)
    r[1].image('https://th.bing.com/th/id/OIP.B7LPxg_mGJE-UIWXGCSczQHaHa?pid=ImgDet&w=852&h=852&rs=1',width=360)
    m = st.columns(3)
    m[1].markdown('## - Front Arm -')
    st.markdown('#### วิธีการเล่น Front Arm(Dumbbell,Barbell) แบบพื้นฐาน')
    st.write('การเล่นบาร์เบลในส่วน Front Arm จะช่วยให้การยกน้ำหนักและการมั่นคงทั้งสองข้าง '
             'ตอนยกน้ำหนักจะค่อยๆยก ช้าๆ โฟกัสกล้ามเนื้อที่ต้องการเล่น ซึ่งท่าทั้จะเล่นมีดังนี้')
    st.write('        ')
#------------ 1 --------------------------------------------------------------------------------------------------------
    st.markdown('##### 1.Incline Dumbbell Curls')
    r, m, l,er = st.columns(4)
    r.image('https://planforfit.com/wp-content/uploads/2015/06/incline-hammer-curls-finish-1.jpg',width=440)
    st.markdown('###### วิธีการเล่น')
    st.write('1.สูดลมหายใจเข้าจนสุด จากนั้นเริ่มออกแรงเกร็งที่กล้ามเนื้อหน้าแขน เพื่อยกดัมเบลขึ้นมาจนสุดพิสัยในลักษณะที่ฝ่ามือทั้งสองข้างยังคงหันเข้าหาลำตัว '
             'โดยในการขยับนั้นจะให้เคลื่อนที่เฉพาะแขนท่อนปลาย ต้นแขนนั้นจะไม่ขยับ พร้อมกับปล่อยลมหายใจออกจนสุด')
    st.write('2.จากนั้นค่อยๆคลายกล้ามเนื้อหน้าแขนออก ลดดัมเบลลงจนสุด เพื่อกลับสู่ท่าเตรียม พร้อมทั้งสูดลมหายใจเข้าจนสุด นับเป็น 1 ครั้ง')
    st.error('*-*ตลอดการฝึกด้วยท่า Incline Dumbbell Hammer Curls พยายามให้หัวติดเบาะตลอดการฝึก เพื่อให้แนวกระดูกสันหลังเป็นไปตามธรรมชาติ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    r, mi, le = st.columns(3)
    video_file = open('Video/step1.mp4', 'rb')
    video_bytes = video_file.read()
    r.video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=j4o_zSevpg8')
#----------- 2 ---------------------------------------------------------------------------------------------------------
    st.write('        ')
    st.markdown('##### 2.Narrow Grip Barbell Curl')
    rig, md, led = st.columns(3)
    rig.image('https://www.muscle.in.th/file/img/exercise-thumb/barbell-curl-1.jpg',width=300)
    md.image('https://www.muscle.in.th/file/img/exercise-thumb/barbell-curl-2.jpg',width=300)
    st.write('1. ถือบาร์เบลให้แขนเหยียดตรง จับบาร์โดยหันฝ่ามือออกมาข้างหน้าลำตัว ระยะห่างระหว่างมือทั้ง 2 ข้างเท่ากับความกว้างของหัวไหล่ (รูปที่ 1)')
    st.write('2. ออกแรงยกบาร์ขึ้นมาจนถึงระดับหัวไหล่ (รูปที่ 2) โดยที่ตลอดการออกแรงยก ข้อศอกต้องอยู่กับที่ตลอดเวลา')
    st.write('3. ค่อยผ่อนบาร์เบลลงสู่ตำแหน่งเริ่มต้นช้า (2-4 วินาที) โดยที่ตลอดการผ่อนแรง ข้อศอกต้องอยู่กับที่ตลอดเวลาเช่นกัน')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    rg, g, lt = st.columns(3)
    video_file = open('Video/step2.mp4', 'rb')
    video_bytes = video_file.read()
    rg.video(video_bytes)
    st.write('คลิปจาก:','https://www.youtube.com/watch?v=j4o_zSevpg8')
#----------------- 3 -------------------------------------------------------------------------------------------------=------
    st.write('        ')
    st.markdown('##### 3.Concentration Curl')
    cole = st.columns(3)
    cole[0].image('https://www.wonderful.in.th/wp-content/uploads/2014/07/Concentration-Dumbbell-Curl.jpg', width=400)
    st.write('วิธีการทำท่าConcentration Curl คือนั่งบนม้านั่งและถือกดัมเบล เอาข้อศอกยันไว้กับหัวเข่าและยกดัมเบลขลอยขึ้นมา '
             'หลังจากนั้นก็ยกแขนขึ้นมาอย่างช้าๆ ให้ดัมเบลสูงขึ้นเกือบตติดหน้าอก เกร็งกล้ามเนื้อทิ้งไว่2วินาที หลังจากนั้นผ่อนดัมเบลลงมาที่เดิมอย่างช้าๆ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/step3.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=j4o_zSevpg8')
    st.markdown('#### ข้อแนะนำ')
    st.text_area(' ','ในแต่ละท่าจะเล่นท่าละ 15 ครั้ง ท่าละ 4 เซ็ต จำนวนครั้งสามารถเพิ่มได้ถ้าเรายกน้ำหนักเบาจาก15ก็อาจจะเป็น20'
                     '  ถ้ายกน้ำหนักเยอะเราก็ลดจำนวนครั้งลงได้จาก15อาจจะเป็น 10,7,6 ครั้งก็ได้ อยู่ที่เรายกได้หนักแค่ไหน')
#------------------- End front arm -------------------------------------------------------------------------------------
elif behind_arm:
    st.markdown('## กล้ามเนื้อแขน(Arm)')
    right, mid, left, los = st.columns(4)
    mid.image('https://i.pinimg.com/originals/d9/18/3b/d9183b3d492dc8bc34e7137f4b0ac135.jpg',width=400)
    rfb, rgb, lrd = st.columns(3)
    rgb.markdown('## - Behind Arm -')
    st.markdown('#### วิธีการเล่น Behind Arm(Dumbbell) แบบพื้นฐาน')
    st.write(' ดูเหมือนว่าคนที่เพิ่งหัดเล่นเวทเพื่อสร้างกล้ามแขนให้ฟิต แอนด์ เฟิร์มใหม่ ๆ หลายคนนั้น มักนิยมออกกำลังท่าที่เน้นให้กล้ามแขนส่วนไบเซ็ปส์ใหญ่ขึ้น จนละเลยกล้ามเนื้อหลังแขนไปซะอย่างนั้น ทั้งที่ความจริงการจะมีไลน์กล้ามแขนสวย ๆ ได้ คุณยังต้องเพิ่มกล้ามเนื้อส่วนไทรเซ็ปส์ด้วยเช่นกัน '
             'บางคนที่หลังแขนเนื้อย้วยเชียว ซึ่งดูไม่โอเคเท่าไร ว่าแล้วเราเลยรวบรวมเอาท่าเล่นหลังแขนมาให้ได้ลองฝึกดังนี้')
    st.write('        ')
    st.markdown('##### 1.Standing Dumbbell Triceps Extension')
    cole = st.columns(3)
    cole[0].image('Video/hind1.jpg', width=450)
    st.write('เริ่มด้วยการยืนตัวตรงและวางเท้าให้ห่างกันเล็กน้อย ส่วนมือทั้งสองข้างจับดัมเบลไว้โดยที่แขนเหยียดตรง ต่อมาค่อยๆ งอศอกลง กระทั่งดัมเบลเคลื่อนมาอยู่ที่ระดับศีรษะ แล้วจึงดันกลับขึ้นสู่ท่าเตรียม')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/hind1.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=xZTH9x8NRYM')
#-------------------------1---------------------------------------------------------------------------------------------
    st.write('        ')
    st.markdown('##### 2.Tricep Dumbbell Kickback')
    cole = st.columns(3)
    cole[0].image('Video/hind2.jpg', width=450)
    st.write('เริ่มจากวางเข่าและมือซ้ายลงบนม้านั่งโดยโน้มตัวไปด้านหน้าพอประมาณ ขณะที่เท้าขวาเหยียบพื้นและมือขวาจับดัมเบลไว้ จากนั้นยกดัมเบลไปด้านหลังช้า ๆ แล้วดึงกลับ ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/kickback.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=hUMGXcRFRQQ')
#--------------------- 2 -----------------------------------------------------------------------------------------------
    st.write('        ')
    st.markdown('##### 3.Dumbbell Skull Crusher')
    cole = st.columns(3)
    cole[0].image('Video/hind3.jpg', width=450)
    st.write('นอนหงายลงบนม้านั่งออกกำลัง ขณะที่มือทั้งสองข้างจับดัมเบลไว้พร้อมเหยียดแขนขึ้นให้สุด จากนั้นให้งอข้อศอกลงมาช้าๆ จนดัมเบลลงมาอยู่ที่ระดับหู แล้วดันแขนขึ้นเพื่อกลับสู่ท่าเริ่มต้นนับเป็น 1 ครั้ง ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/skull.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=74Uu7PI5pY4')
    st.markdown('#### ข้อแนะนำ')
    st.text_area(' ',
                 'ในแต่ละท่าจะเล่นท่าละ 15 ครั้ง ท่าละ 4 เซ็ต จำนวนครั้งสามารถเพิ่มได้ถ้าเรายกน้ำหนักเบาจาก15ก็อาจจะเป็น20'
                 '  ถ้ายกน้ำหนักเยอะเราก็ลดจำนวนครั้งลงได้จาก15อาจจะเป็น 10,7,6 ครั้งก็ได้ อยู่ที่เรายกได้หนักแค่ไหน')
#----------------------------- End lab1 ---------------------------------------------------------------------------------------

#-------------- Back ---------------------------------------------------------------------------------------------------
with lab2:
    top_back = st.button('Top Back')
    shoulder = st.button('Shoulder')
if top_back:
    st.markdown('## กล้ามเนื้อหลัง(Back)')
    c = st.columns(4)
    c[1].image('Video/back.jpg',width=450)
    cole = st.columns(3)
    cole[1].markdown('## - Top Back - ')
    st.write(' ท่าเล่นกล้ามหลังให้ใหญ่แบบง่ายๆ คัดมาเน้นๆ สำหรับคนที่อยากปั้นกล้ามเนื้อหลังให้ฟิต แอนด์ เฟิร์มโดยเฉพาะ'
             ' บางท่าก็ทำที่บ้านได้ชิลๆ ที่รับรองว่าถ้ามีวินัยและทำตามท่านี้ได้หุ่นแซ่บ เท่ แข็งแรงภายใน 1 เดือนแบบที่คุณก็รู้สึกได้!')
    st.markdown('#### 1.Lat Pull Down')
    col = st.columns(4)
    col[0].image('Video/pull1.jpg',width=350)
    col[2].image('Video/pull2.jpg',width=350)
    st.write('เริ่มต้นจากการคว่ำมือทั้งสองข้างลง จับบาร์ด้วยความกว้างที่กว้างกว่าหัวไหล่ประมาณครึ่งศอก จากนั้นนั่งลงบนเบาะของเครื่อง Lat Pulldown '
             'พยายามล็อกขากับเบาะรองไว้ให้แน่น ปล่อยให้กล้ามเนื้อหลังถูกเหยียดออกจนสุด ไปตามแรงของเคเบิ้ล')
    st.write('1.เริ่มต้นจากการสูดลมหายใจเข้าจนสุด จากนั้น แอ่นอก ออกแรงเกร็งกล้ามเนื้อหลัง เพื่อดึงด้ามจับลงมาจนสัมผัสกับหน้าอก '
             'โดยในขณะที่ออกแรงนั้นพยายามปิดมุมข้อศอก เข้าหาลำตัว พร้อมกับปล่อยลมหายใจออกจนสุด ')
    st.write('2.ค่อยๆคลายกล้ามเนื้อหลังออก ปล่อยด้ามจับกลับขึ้นไป เพื่อกลับสู่ท่าเตรียม พร้อมกับสูดลมหายใจเข้าจนสุด นับเป็น 1 ครั้ง ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/pull.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=TBIq9-Ecyq4')
#----------------------------- 1 ---------------------------------------------------------------------------------------
    st.markdown('#### 2.Machine Row')
    col = st.columns(4)
    col[0].image('Video/row1.jpg', width=350)
    col[2].image('Video/row2.jpg', width=350)
    st.write('เริ่มต้นจากการเซ็ตเบาะให้เวลาดึงแล้วถึงลิ้นปี่พอดี ใช้ศอกลากเข้ามา ดึงเข้ามาเวลาดึงให้เปิดศอก แอ่นอกรับ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/row.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=TBIq9-Ecyq4')
#------------------------ 2 --------------------------------------------------------------------------------------------
    st.markdown('#### 3.Low Row')
    col = st.columns(4)
    col[0].image('Video/low1.png', width=350)
    col[2].image('Video/low2.png', width=350)
    st.write('เรื่มจากจับบาร์แล้วลากศอกขึ้นด้านบนลากขึ้นช้าๆ โดยจะโฟกัสไปที่หลังบน แล้วค่อยๆผ่อนกลับลงมาที่เดิมอย่างช้าๆ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/low.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=TBIq9-Ecyq4')
    st.markdown('#### ข้อแนะนำ')
    st.text_area(' ',
                 'ในแต่ละท่าจะเล่นท่าละ 15 ครั้ง ท่าละ 4 เซ็ต จำนวนครั้งสามารถเพิ่มได้ถ้าเรายกน้ำหนักเบาจาก15ก็อาจจะเป็น20'
                 '  ถ้ายกน้ำหนักเยอะเราก็ลดจำนวนครั้งลงได้จาก15อาจจะเป็น 10,7,6 ครั้งก็ได้ อยู่ที่เรายกได้หนักแค่ไหน')
#---------------------------- End 3 ----------------------------------------------------------------------------------------
elif shoulder:
    st.markdown('## กล้ามเนื้อหลัง(Back)')
    c = st.columns(5)
    c[1].image('Video/shoul.jpg', width=450)
    cole = st.columns(3)
    cole[1].markdown('## - Shoulder - ')
    st.write(' กล้ามเนื้อส่วนหัวไหล่ถือเป็นมัดกล้ามเนื้อที่สำคัญซึ่งจะช่วยส่งเสริมให้ผู้ที่ออกกำลังกายและเสริมสร้างมัดกล้ามเนื้อส่วนนี้อยู่เป็นประจำ ช่วยให้มีบุคลิกภาพที่ดี สามารถมองเห็นผลลัพธ์ได้อย่างเด่นชัด '
             'นอกจากนี้ ยังทำให้สามารถสวมเสื้อผ้าต่างๆได้อย่างสวยงามและดูดีมากกว่าปกติ '
             ' ด้วยเหตุนี้จึงถือได้ว่าการมีกล้ามเนื้อช่วงไหล่ที่ดีนั้น ถือเป็นอีกหนึ่งตัวช่วยที่จะเสริมสร้างเสน่ห์ให้กับใครหลายๆคนได้เป็นอย่างดีเลยทีเดียว')
    st.markdown('#### 1.Rear Delt Fly')
    col = st.columns(4)
    col[0].image('Video/rear.jpg', width=350)
    st.write('1.เริ่มยืนโดยให้เท้าของคุณห่างกันและถือดัมเบลไว้ในมือแต่ละข้าง')
    st.write(
        '2.ดันสะโพกไปด้านหลังและงอเข่าเล็กน้อยในขณะที่คุณโน้มลําตัวไปข้างหน้าด้วยหลังแบนราบ รักษาตําแหน่งบานพับสะโพกนี้ตลอดการออกกําลังกาย')
    st.write('3.ปล่อยให้ตุ้มน้ําหนักห้อยลงมาที่พื้นโดยให้ข้อศอกงอเล็กน้อยและฝ่ามือหันเข้าหากัน')
    st.write('4.วางไหล่ของคุณให้ห่างจากหูและงอข้อศอกเล็กน้อยยกน้ําหนักออกไปด้านข้างจนกว่าจะอยู่ในแนวเดียวกับไหล่ของคุณ')
    st.write('5.ลดดัมเบลด้วยการควบคุม ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/fly.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=4k_Fh8IM8IQ')
#------------------- 1 -------------------------------------------------------------------------------------------------
    st.markdown('#### 2.Shoulder Press')
    col = st.columns(4)
    col[0].image('Video/press.jpg', width=370)
    st.write('1.นั่งตัวตรงแยกเท้าออกจากกันให้กว้างเท่าสะโพก')
    st.write('2.ยกดัมเบลขึ้นระดับไหล่')
    st.write('3.ปล่อยให้ตุ้มน้ําหนักห้อยลงมาที่พื้นโดยให้ข้อศอกงอเล็กน้อยและฝ่ามือหันเข้าหากัน')
    st.write('4.เกรงหน้าท้อง และสะโพก แล้วทำการดันดัมเบลขึ้นไปเหนือศรีษะ ')
    st.write('5.ลดระดับดัมเบลกลับลงมาโดยการหดคางเพื่อให้นำ้หนักมาพักที่ระดับอกเช่นเดิม ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/press.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=ZBX1UH2O1eg')
    st.markdown('#### ข้อแนะนำ')
    st.text_area(' ',
                 'ในแต่ละท่าจะเล่นท่าละ 15 ครั้ง ท่าละ 4 เซ็ต จำนวนครั้งสามารถเพิ่มได้ถ้าเรายกน้ำหนักเบาจาก15ก็อาจจะเป็น20'
                 '  ถ้ายกน้ำหนักเยอะเราก็ลดจำนวนครั้งลงได้จาก15อาจจะเป็น 10,7,6 ครั้งก็ได้ อยู่ที่เรายกได้หนักแค่ไหน')

#------- end lab2 ------------------------------------------------------------------------------------------------------
with lab3:
    top_chest = st.button('Top Chest')
if top_chest:
    st.markdown('## กล้ามเนื้ออก(Chest)')
    c = st.columns(4)
    c[1].image('Video/chest.jpg',width=450)
    cole = st.columns(3)
    cole[1].markdown('## - Top Chest - ')
    st.write(' ท่าเล่นกล้ามหลังให้ใหญ่แบบง่ายๆ คัดมาเน้นๆ สำหรับคนที่อยากปั้นกล้ามเนื้อหลังให้ฟิต แอนด์ เฟิร์มโดยเฉพาะ'
             ' บางท่าก็ทำที่บ้านได้ชิลๆ ที่รับรองว่าถ้ามีวินัยและทำตามท่านี้ได้หุ่นแซ่บ เท่ แข็งแรงภายใน 1 เดือนแบบที่คุณก็รู้สึกได้!')
    st.markdown('#### 1.Push Up')
    col = st.columns(4)
    col[1].image('Video/push.jpg',width=350)
    st.write('1. เหยียดลำตัวให้ตรง แขนเหยียดตรง โดยให้ไหล่ แขน และมืออยู่ในแนวเดียวกัน ฝ่าเท้าตั้งฉากกับพื้นทั้งคู่ ให้ตั้งแขนแบบหุบแขนเข้าดังภาพ')
    st.write('2. ย่อตัวลงช้าๆ ห้ามหลังแอ่น ให้ระยะหน้าอกห่างพื้นประมาณ 10 ซม. ไม่ต้องติดพื้น จากนั้นค่อยๆยกตัวขึ้น ')
    st.write('3. หายใจเข้าตอนหย่อนตัว หายใจออกตอนยกตัว 4. ทำ 15-20 ครั้ง ใน 3 เซ็ท')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/push.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=OhvhHDIxoZ0')
#------------------- 1 -------------------------------------------------------------------------------------------------
    st.markdown('####   2.Dumbbell Bench Press')
    col = st.columns(4)
    col[1].image('Video/brenc.jpg', width=350)
    st.write( 'นอนลงบนม้านั่งพร้อมกับใช้มือทั้งสองข้างยกดัมเบลไว้เหนือหน้าอก เมื่อพร้อมแล้ว ให้ดันดัมเบลขึ้นจนสุดแขนและผ่อนลงเป็นจังหวะ ควรฝึกให้ได้ 3 เซต เซตละ 6 ครั้ง พักระหว่างเซต 2 นาที')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/db.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=WTHdmYmTY54')
#------------------- 2 -------------------------------------------------------------------------------------------------
    st.markdown('####  3. Dip')
    col = st.columns(4)
    col[1].image('Video/dip.jpg', width=350)
    st.write(
        ' เริ่มจากยืนหันหลังให้เครื่องออกกำลังกาย ใช้มือจับบาร์ที่ด้านข้างลำตัวไว้ทั้งสองข้าง เมื่อพร้อมแล้วให้ดันตัวขึ้น-ลงช้าๆ เป็นจังหวะ ควรทำให้ได้ 6 ครั้ง ทั้งหมด 3 เซต พักระหว่างเซตได้ 2 นาที')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/dip.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=94E0jMK3q00')
#---------------- 3 ----------------------------------------------------------------------------------------------------
    st.markdown('####  4.Incline Push-Up')
    col = st.columns(4)
    col[1].image('Video/inc.jpg', width=350)
    st.write('จัดท่าเตรียมในท่าวิดพื้น แต่ให้วางมือทั้งสองข้างบนม้านั่ง จากนั้นดันตัวลงจนหน้าอกเกือบติดม้านั่งแล้วกลับขึ้นมาสู่ท่าเตรียม นับเป็นหนึ่งครั้ง ทำให้ครบ 6 ครั้ง ทั้งสิ้น 3 เซต และพัก 2 นาทีระหว่างเซต ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/inc.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=yY-vKSsa5e0')
#------------------ End 4 ----------------------------------------------------------------------------------------------
with lab4:
    abs = st.button('Abs rip')
if abs:
    st.markdown('## กล้ามหน้าท้อง(Abdominal Muscle)')
    c = st.columns(5)
    c[1].image('Video/abs.jpg', width=450)
    cole = st.columns(3)
    cole[1].markdown('## - Abdominal - ')
    st.write('  ก่อนออกกำลังกายเสริมกล้ามท้อง ควรจำเคล็ดลับทั้ง 5 ข้อนี้ไว้ก่อน เพราะทั้งหมดจะช่วยเสริมให้กล้ามท้องของคุณแข็งแรงและลดพุงได้ดีขึ้น เริ่มจาก')
    st.write('1. เน้นกินอาหารประเภทโปรตีนโปรตีน คือสารอาหารที่ขาดไม่ได้สำหรับคนรักการออกกำลังกาย เพราะนอกจากช่วยซ่อมแซมสร้างกล้ามเนื้อแล้ว ยังช่วยรักษาระดับการเผาผลาญ รวมถึงรักษามวลกล้ามเนื้อระหว่างการลดน้ำหนักได้ ดังนั้น จึงควรเสริมโปรตีนให้ร่างกายอย่าให้ขาดครับ')
    st.write('2. เสริมด้วยคาร์ดิโอ ถ้าอยากมีกล้ามท้องอีกเรื่องที่ต้องเอาชนะให้ได้คือระดับไขมันบนหน้าท้อง การคาร์ดิโอเป็นหนึ่งตัวช่วยทำให้กล้ามท้องชัดเจนขึ้น โดยผลจากการศึกษาพบว่า ผู้ชายที่ทำคาร์ดิโอเป็นจำ 3-4 ครั้งต่อสัปดาห์ มีไขมันบนหน้าท้องลดลง และการคาร์ดิโอยังช่วยเผาผลาญไขมันหน้าท้องได้จริงหากทำอย่างต่อเนื่อง')
    st.write('3. อย่าให้ร่างกายขาดน้ำ แม้ในเวลาปกติน้ำก็สำคัญกับร่างกายเรามากอยู่แล้ว เพราะช่วยทั้งในการกำจัดของเสียและรักษาอุณหภูมิให้กับร่างกาย  แต่สำหรับคนอยากมีกล้ามท้อง น้ำยังช่วยลดความอยากอาหารและเพิ่มพลังงานชั่วคราวให้ร่างกายได้ ดังนั้น การสร้างกล้ามเนื้อที่ได้ผลดีร่างกายไม่ควรขาดน้ำเด็ดขาด')
    st.write('4. กินไขมันดี ในขณะที่กำจัดไขมันส่วนเกินออกไป ก็ต้องเพิ่มไขมันดีให้ร่างกาย เพราะไขมันดีช่วยในการลดหน้าท้องได้ โดยจากการศึกษาพบว่าคนที่รับไขมันดีจากน้ำมันมะพร้าวระหว่างการลดน้ำหนัก จะสูญเสียไขมันหน้าท้องมากกว่าคนที่รับไขมันจากน้ำมันถั่วเหลือง ด้วยเหตุนี้จึงควรเลือกแหล่งไขมันดี เช่น น้ำมันมะพร้าว, น้ำมันมะกอก, อะโวคาโดและถั่ว เป็นต้น')
    st.write('5. เน้นเพิ่มกล้ามเนื้อหน้าท้อง ส่วน Rectus Abdominis   อย่างที่ทราบกันดีว่า กล้ามท้องส่วน Rectus Abdominis หรือที่เรียกกันว่าซิกแพก คือส่วนสำคัญที่จะแสดงความชัดเจนของกล้ามท้อง ซึ่งการเน้นเพิ่มมวลกล้ามเนื้อให้ Rectus Abdominis จะช่วยให้คุณมีกล้ามท้องชัดและเร็วมากขึ้น แต่อย่าลืมให้ความสำคัญกับการเผาผลาญไขมันหน้าท้องส่วนอื่นประกอบกันไปด้วยนะครับ ')
    st.write('โดยท่าที่เราจะเล่นมีดังนี้')
    st.markdown('#### 1.Crunch')
    col = st.columns(4)
    col[1].image('Video/cru.jpg', width=400)
    st.write('ท่านี้ช่วยลดพุง เพิ่ม six pack จะคล้าย ๆ กับท่าเล่นกล้ามท้องอย่าง Sit – ups มาเริ่มตั้งท่าจากการนอนหงายหน้าราบลงบนพื้น '
             'ประสานกันไว้ที่ท้ายทอย วางเท้าสองข้างให้ห่างกันประมาณหัวไหล่ แล้วตั้งเข่าชันขึ้นมา ออกแรงเกร็งกล้ามเนื้อหน้าท้องเพื่อยกลำตัวส่วนบนให้ขึ้นมา โดยไม่ให้หลังด้านล่างยกขึ้นมาด้วย ค่อยๆ คลายกล้ามเนื้อหน้าท้องออก ลดลำตัวลงแล้วกลับสู่ท่าเตรียม')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/cru.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=bqKq53Zz3D0')
#------------------ 1 --------------------------------------------------------------------------------------------------
    st.markdown('#### 2.Lying Leg Raise')
    col = st.columns(4)
    col[1].image('Video/lying.jpg', width=400)
    st.write(
        'ท่านี้เหมาะมากสำหรับใครที่อยากลดหน้าท้อง หรืออยากสร้างกล้ามหน้าท้องให้สวย ซึ่งท่าเล่นกล้ามท้อง Lying Leg Raise ให้เป้าหมายไปที่ส่วนกลางลำตัวและกล้ามขาโดยตรง เริ่มต้นตั้งท่าโดยการนอนราบลงบนพื้น ยกขาทั้งสองข้างขึ้นเหนือพื้นเล็กน้อย '
        'แล้วเหยียดตรงไปด้านหน้า ออกแรงยกขาให้สูงขึ้น จากนั้นยกขึ้น ยกลง นับเป็น 1 ครั้ง')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/lyleg.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=3L5hPZ-KoUI')
#---------------- 2 ------------------------------------------------------------------------------------------------------
    st.markdown('#### 3.Sitting twists')
    col = st.columns(4)
    col[0].image('Video/sit.jpg', width=400)
    st.write('    เป็นท่าสร้างกล้ามท้องด้านข้างลำตัวที่ช่วยเผาผลาญไขมันได้ด้วย โดยเริ่มจากเตรียมตัวในท่านั่งชันเข่า ให้หัวเขาชิดแต่ไม่ติดกัน '
             'ลำตัวตั้งตรงเอนไปข้างหลังเล็กน้อยและใช้มือทั้ง 2 ข้างวางซ้อนกันตั้งในระดับหน้าอก เมื่อมั่นคงแล้วให้ออกแรงบิดเฉพาะลำตัว โดยแขนทั้ง 2 ข้างยังยกค้างไว้อยู่ การหันหนึ่งข้างนับเป็นหนึ่งครั้ง')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/twis.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=t2BB-Din_jA')
#------------------- 3 -------------------------------------------------------------------------------------------------
    st.markdown('#### 4.Side plank')
    col = st.columns(4)
    col[0].image('Video/side.jpg', width=400)
    st.write(
        ' ท่าออกกำลังกายเพิ่มความแข็งแรงให้กล้ามเนื้อท้องด้านข้างที่ฝึกได้ทุกวัน โดยเริ่มจากท่าเตรียมคล้ายกับท่านอนตะแคง แต่ใช้แขนท่อนล่างและเท้าเป็นจุดรับน้ำหนักหลักของร่างกายทั้งหมด '
        'โดยท่อนแขนต้องยื่นไปด้านหน้าลำตัวเสมอ ก่อนออกแรงเหยียดขาให้ตรง พร้อมกับยกลำตัวขึ้นให้ร่างกายทุกส่วนขนานกัน โดยเน้นใช้แรงจากกล้ามเนื้อด้านข้างท้องเป็นตัวช่วยพยุง จับเวลาทำและสลับข้าง ข้างละ 30 วินาที ถึง 1 นาที นับเป็น 1 เซต ')
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/sidep.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=N8xUYzho82g')
#----------------------- End 4 -----------------------------------------------------------------------------------------
with lab5:
    abs = st.button('Full Leg')
if abs:
    st.markdown('## กล้ามขา(Leg Muscle)')
    c = st.columns(5)
    c[1].image('Video/leg.jpg', width=450)
    cole = st.columns(3)
    cole[1].markdown('## - Full Leg - ')
    st.write('')
    st.write('โดยท่าที่เราจะเล่นมีดังนี้')
    st.markdown('#### 1.Kettlebell Swing')
    st.write('ยืนกลางขา กว้างประมานไหล่ ใช้มือสองข้างจับ Kettlebell ยกไปไว้ระหว่างกลางของขาทั้งสองข้าง'
             'โน้มตัวมาด้านหน้าเล็กน้อย จับKettlebell ให้แน่นและมั่นคง'
             'ย่อขาลงพร้อมกันทั้งสองข้าง และยืดขาขึ้นพร้อมกับยก Kettlebell ให้ลอยขึ้น มาอยู่ระดับ หน้าผาก'
             'ระบบการหายใจ เมื่อยกตัวขึ้นมาให้หายใจออก และเมื่อลด Kettlebell ลงให้หายใจเข้า'
             'จะนวนครั้งที่ยก ยกทั้งหมด 15 ครั้ง พัก 1 นาที ทำจำนวน 3เซ็ท')
    col = st.columns(4)
    col[1].image('Video/ket.jpg', width=400)
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/swing.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=7Mmkmc6cj1Y')
#--------------------------------- 1 -----------------------------------------------------------------------------------
    st.markdown('#### 2.Barbell Squat')
    st.write(' เริ่มจากยืนแบกบาร์เบลพาดหลังไว้ พร้อมแยกเท้าให้กว้างพอประมาณ จากนั้นค่อยๆ '
             'ย่อตัวลงให้ต่ำที่สุดเท่าที่ทำได้ในท่าสควอท แล้วค่อย ๆ ลุกขึ้นยืนตรงเหมือนท่าเริ่มต้น '
             'โดยวิธีนี้นอกจากจะช่วยบริหารกล้ามเนื้อขาได้ดีแล้ว '
             'ยังเสริมความแข็งแรงให้กับสะโพกและเอ็นร้อยหวายด้วย')
    col = st.columns(5)
    col[1].image('Video/bars.jpg', width=450)
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/barsq.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=TBIq9-Ecyq4')
#------------------------------- 2 -------------------------------------------------------------------------------------
    st.markdown('#### 3.Barbell Deadlift ')
    st.write('ยืนกลางขา เล็กน้อยใช้มือทั้งสองข้างจับ บาร์เบล ห่างประมานหัวไหล่โน้มตัวมาด้านหน้าเล็กน้อย ย่อเข่าลงและจับบาร์เบลให้แน่ ล็อคข้อมือ'
              'ย่อขาลงพร้อมกันทั้งสองข้าง และยืดขาขึ้นพร้อมยกบาร์เบลขึ้นมาด้วยในรูปแบบของการยืนในท่าตรง'
              'ระบบการหายใจ เมื่อยกบาร์เบลขึ้นมาให้หายใจออก และเมื่อเอาบาร์เบลลงให้หายใจเข้า'
              'จะนวนครั้งที่ยก ยกทั้งหมด 15 ครั้ง พัก 1 นาที ทำจำนวน 2 เซ็ท')
    col = st.columns(5)
    col[1].image('Video/bard.jpg', width=450)
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/dead.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=uFT9WLbqW9A')
#-------------------------------- 3 ------------------------------------------------------------------------------------
    st.markdown('#### 4.Lying Leg Curl ')
    st.write('จัดท่าเตรียมโดยการนอนคว่ำหน้าลงบนม้านั่งและสอดเท้าลงไปใต้บาร์ เมื่อพร้อมแล้วให้งอขาเข้าหาลำตัวและผ่อนกลับไปยังท่าเริ่มต้นช้าๆ '
        'โดยวิธีนี้จะช่วยสร้างกล้ามเนื้อขาและความแข็งแรงให้เอ็นร้อยหวายได้ดีเลยที เดียว')
    col = st.columns(5)
    col[1].image('Video/ly.jpg', width=450)
    st.write('มาชมคลิปตัวอย่างกัน: ')
    col = st.columns(3)
    video_file = open('Video/legl.mp4', 'rb')
    video_bytes = video_file.read()
    col[0].video(video_bytes)
    st.write('คลิปจาก:', 'https://www.youtube.com/watch?v=tXm6Prjv1Ko')

#-------------- End tab1 -----------------------------------------------------------------------------------------------
with tab2:
    st.title('การคำนวณค่า BMI')
    st.write('การหาค่าดัชนีมวลกาย (Body Mass Index : BMI) คือเป็นมาตรการที่ใช้ประเมินภาวะอ้วนและผอม สามารถทำได้โดยการชั่งน้ำหนักตัวเป็นกิโลกรัมและวัดส่วนสูงเป็นเซนติเมตร '
            'แล้วนำมาหาดัชมีมวลกาย')
    st.write('                ')
    col1, col2 = st.columns(2)
    with col1:
        tall = st.number_input('ส่วนสูง :',min_value=1)
    with col2:
        weigh = st.number_input('น้ำหนัก :',min_value=1)

    col = st.columns(5)
    cal = col[4].button('Enter')
    if cal:
        tall = tall/100
        all = weigh/(tall**2)
        avg = st.write('ค่า BMI ของคุณคือ: ',all)
        if all >0 and all < 18.50:
           porm = st.warning('น้ำหนักน้อย/ผอม')
           if porm:
            st.text_area('ขอแนะนำสำหรับน้ำหนักน้อยกว่าปกติ:',('1. กรณีกินเยอะแต่ไม่อ้วน ก็ต้องระวังเรื่องคุณภาพของอาหารที่กินเข้าไปด้วย เลือกกินอาหารที่ดีมีประโยชน์ ลดหวาน มัน เค็ม และหลีกเลี่ยงอาหารที่มีไขมันสูง เพราะอาจเพิ่มความเสี่ยงต่อการเป็นโรคเบาหวาน ความดันเลือดสูง ไขมันในเลือดสูง หรือผอมลงพุงได้'
                                                     '                                                       '
                                                              '      2. เลือกกินอาหารให้หลากหลายครบ 5 หมู่ โดยเน้นอาหารที่มีโปรตีน เพื่อช่วยในการเสริมสร้างกล้ามเนื้อ หากต้องการเพิ่มน้ำหนัก ให้ไม่ผอมจนเกินไป ให้เพิ่มปริมาณการกินอาหารประมาณ 300-500 กิโลแคลอรี โดยเน้นการกินอาหารที่มีประโยชน์ คาร์โบไฮเดรตเชิงซ้อน และไขมันดี'
                                                     '                   3. เคลื่อนไหว และออกกำลังกายสม่ำเสมอ ระดับความหนักปานกลาง โดยเลือกกิจกรรมการออกกำลังกายที่ชื่นชอบและสนุกสนาน เพื่อส่งเสริมให้อยากออกกำลังกาย ลดความเบื่อหน่าย เช่น การเต้นเข้าจังหวะ เดิน วิ่ง ว่ายน้ำ หรือกิจกรรมออกแรง ขยับร่างกายในชีวิตประจำวัน อย่างการทำงานบ้าน การทำสวน เป็นต้น แนะนำให้ออกกำลังกาย อย่างน้อยวันละ 30 นาที หรือ ไม่น้อยกว่า 150 นาทีต่อสัปดาห์'))
        elif all >18.49 and all <23.00:
            defulse = st.success('ปกติ')
            if defulse:
                st.text_area('ขอแนะนำสำหรับน้ำหนักปกติ:',('1. เลือกกินอาหารให้ได้สัดส่วนพอเหมาะ และเลือกอาหารที่ดี มีประโยชน์ ครบ 5 หมู่ กำหนดปริมาณอาหารให้เพียงพอต่อความต้องการ การใช้พลังงานของร่างกาย อาหารกลุ่มคาร์โบไฮเดรตให้เลือกเป็น ข้าว-แป้งขัดสีน้อย ธัญพืช ไม่น้อยกว่า 6 ทัพพี กินผักหลากหลาย ถั่ว ผลไม้อ่อนหวาน รวมกันไม่น้อยกว่า 400 กรัมต่อวัน เพื่อให้ได้รับสารอาหาร วิตามิน เกลือแร่อย่างเพียงพอ เกิดความสมดุลด้านโภชนาการ และมีส่วนช่วยให้รักษา และควบคุมน้ำหนักให้อยู่ในเกณฑ์ได้'
                                                      '                                                                                                                                                                                                                                                                                    2. ออกกำลังกาย หรือเคลื่อนไหวร่างกายสม่ำเสมอ เลือกความเข้มข้นของกิจกรรมการออกกำลังกาย ที่ระดับปานกลาง หรือ ใช้ชีวิตให้กระฉับกระเฉง ลุกเดิน'
                                                      ' เคลื่อนไหวร่างกายบ่อยๆ หากรักในการออกกำลังกาย ควรเลือกกิจกรรมที่ชื่นชอบและสนุกสนาน จะช่วยลดความเบื่อหน่าย ทำได้บ่อย และสม่ำเสมอมากขึ้น นอกจากนี้การออกกำลังกาย มีส่วนช่วยให้สุขภาพร่างกายแข็งแรง สมบูรณ์ '
                                                      'กล้ามเนื้อแข็งแรง มีส่วนช่วยลดความเสี่ยงในการเกิดโรคไม่ติดต่อเรื้อรัง(NCDs) ต่างๆ ได้ ถ้าหากต้องการให้สมรรถภาพร่างกายดีขึ้น ควรเลือกการออกกำลังกายแบบแอโรบิค เช่น เดินเร็วๆ วิ่งเหยาะ ถีบจักรยานเร็วๆ กระโดดเชือก ว่ายน้ำ หรือเล่นกีฬา โดยทำสม่ำเสมอวันละ 20 - 30 นาที อย่างน้อย 3 - 4 วัน / สัปดาห์'))
        elif all >22.99 and all <25.00:
            uan = st.warning('ท้วม')
            if uan:
                st.text_area('ข้อแนะนำสำหรับคนท้วม:','1. ต้องเริ่มควบคุม และเลือกกินอาหารให้เหมาะสม ปรับเปลี่ยนพฤติกรรมการกินอาหาร โดยเน้นเลือกกินอาหารที่ดีมีประโยชน์ ครบ 5 หมู่ กำหนดปริมาณตามความต้องการพลังงานของร่างกาย หรือลดจากเดิมเล็กน้อย ประมาณ 200-300 กิโลแคลอรี โดยค่าปริมาณพลังงานจากอาหารที่กินในแต่ละวันเฉลี่ยไม่ควรน้อยกว่า 1,000 - 1,200 กิโลแคลอรี หรือไม่น้อยกว่าค่า BMR ของแต่ละคน เพื่อป้องกันการจำกัดอาหารมากจนเกินไป ที่อาจส่งผลให้ร่างกายได้รับสารอาหารไม่เพียงพอ'
                                                         'ใส่ใจเรื่องโภชนาการให้มากขึ้น ลดอาหารหวาน มัน และเค็มจัด โดยเฉพาะ อาหาร ขนม ของหวาน เครื่องดื่มที่มีน้ำตาล และเครื่องดื่มที่มีแอลกอฮอล์ อาหารแปรรูปต่างๆ กินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม เลือกกินข้าว - แป้ง ขัดสีน้อย ธัญพืชต่างๆ และกินผัก - ผลไม้อย่างน้อย 400 กรัม / วัน ไม่อด ไม่งดอาหารมากจนเกินไป เพื่อให้สามารถควบคุมอาหารได้ดีมากยิ่งขึ้น'
                                                         '                                                                                                                  '
                                                         '                                                      2. เคลื่อนไหว และออกกำลังกายแบบแอโรบิคอย่างสม่ำเสมอ เลือกความเข้มข้นปานกลาง โดยทำอย่างน้อยวันละ 30 - 40 นาที 4 - 5 วัน/สัปดาห์ สำหรับคนที่ไม่เคยออกกำลังกาย ควรเริ่มด้วยกิจกรรมเบาๆ เช่นการเดิน หรือ วิ่งจ๊อกกิ้ง ปั่นจักรยาน ทำต่อเนื่อง เพื่อให้ร่างกายเกิดความคุ้นเคย และพัฒนาความแข็งแรงขึ้น แล้วจึงค่อยๆ เพิ่มความเข้มข้นของกิจกรรมขึ้นทีละน้อย'
                                                         '                                                                              '
                                                         '                                                3. เสริมการฝึกเวทเทรนนิ่ง เพื่อเพิ่มความแข็งแรง และปริมาณของกล้ามเนื้อ ที่มีส่วนช่วยในการเผาผลาญพลังงาน และทำให้ไขมันลดลง สำหรับผู้ที่ไม่เคยฝึกการออกกำลังกายแบบใช้แรงต้าน หรือ เวทเทรนนิ่ง อาจเริ่มต้นด้วยกิจกรรมแบบบอดี้เวทง่ายๆ โดยใช้แรงต้านจากน้ำหนักตัวเอง เช่นการทำท่า แพลงกิ้ง สควอช หรือซิทอัพ ก็ได้ หรือหากต้องการใช้ลูกน้ำหนัก หรืออุปกรณ์เสริมแรงต้าน ก็ควรศึกษาหาข้อมูล หรือรับคำแนะนำจากผู้เชี่ยวชาญ ก่อนลงมือปฏิบัติ เพื่อป้องกันอุบัติเหตุ หรืออันตรายที่อาจเกิดขึ้นจากการออกกำลังกายผิดวิธี')
        elif all >24.99 and all <30.00:
            rerm = st.error('อ้วน')
            if rerm:
                st.text_area('ข้อแนะนำสำหรับนคนอ้วน:',('1. การควบคุมอาหารมีส่วนสำคัญอย่างมาก ที่จะช่วยให้สามารถลดน้ำหนักให้อยู่ในเกณฑ์ปกติได้ควรปรับ             เ'
                                                       'ปลี่ยนพฤติกรรมการกินอาหาร โดยเลือกกินอาหารให้หลากกลาย แต่มีประโยชน์ กำหนดปริมาณการกินที่เหมาะสม ต่อความต้องการพลังงาน ไม่ลด ไม่งด หรือ อดอาหารมากจนเกินไป ลดพลังงานจากอาหารในแต่ละวันเล็กน้อย ประมาณ 200 - 300 กิโลแคลอรี โดยค่าปริมาณพลังงานจากอาหารที่กินในแต่ละวันเฉลี่ยไม่ควรน้อยกว่า 1,000 - 1,200 กิโลแคลอรี หรือไม่น้อยกว่าค่า BMR ของแต่ละคน ลด หรือหลีกเลี่ยงการกินอาหารที่มีน้ำตาลสูง ขนมหวาน , เครื่องดื่มที่มีรสหวาน ของทอด อาหารแปรรูป อาหารที่มีไขมันอิ่มตัวสูง และควรควบคุมอาหารที่มีปริมาณโซเดียมสูงด้วย'
                                                       'เลือกกินอาหารโดยเน้นที่โภชนาการครบถ้วน เพื่อให้ร่างกายได้สารอาหาร และวิตามินที่มีประโยชน์ เช่น ข้าว - แป้งขัดสีน้อย ธัญพืช ถั่ว '
                                                       'เนื้อสัตว์ไขมันต่ำ อกไก่ ไข่ และเนื้อปลา กินผักและผลไม้อ่อนหวาน ในสัดส่วนที่พอเหมาะ หรืออย่างน้อย 400 กรัมต่อคนต่อวัน'
                                                       '       2. คนที่มีน้ำหนักตัวมาก ก่อนจะเริ่มออกกำลังกาย ควรปรึกษา หรือรับคำแนะนำจากแพทย์ หรือผู้เชี่ยวชาญ '
                                                       'เพื่อประเมินสมรรถภาพร่างกายเสียก่อน เพื่อป้องกันอันตรายที่อาจเกิดขึ้น จากปัญหาสุขภาพ และร่างกายที่ไม่พร้อม'
                                                       'กิจกรรมการออกกำลังกายที่เหมาะกับคนอ้วน หรือคนที่มีน้ำหนักตัวมาก ควรเริ่มที่กิจกรรมที่ไม่หนักมาก ทำได้ง่า'
                                                       'ย เน้นที่ความหนักปานกลาง เช่นการเดิน หรือการเดินในน้ำ ที่มีส่วนช่วยลดความเสี่ยงต่ออาการบาดเจ็บ จากการออกกำลังกายได้ พยายามออกกำลังกายให้ได้สม่ำเสมอ ประมาณ 40 - 60 นาที / วัน หรือ ในระยะเริ่มต้น อาจใช้เวลาน้อยแต่มากครั้งการออกกำลังกาย โดยทำครั้งละ 10 - 20 นาที 2 - 3 ครั้งต่อวัน เมื่อน้ำหนักตัวลดลด ร่างกายแข็งแรงมากขึ้น จึงค่อยๆเพิ่มความเข้มข้นของกิจกรรม หรือเพิ่มเวลาให้ออกกำลังกายนานขึ้น'
                                                       'ใช้ชีวิตประจำวันให้กระฉับกระเฉง เคลื่อนไหวร่างกายให้มาก หรือหากิจกรรมภายในบ้าน ที่ช่วยให้ได้ขยับร่างกาย อย่างการทำงานบ้าน ทำสวน หรือลุกเดินไปมาบ่อยๆ'
                                                       '                                                                          3. สร้างกล้ามเนื้อด้วยเวทเทรนนิ่ง การออกกำลังกายโดยใช้แรงต้าน จะช่วยเสริมสร้างปริมาณ และส่งเสริมความแข็งแรงของกล้ามเนื้อ ที่เป็นส่วนสำคัญในการเผาผลาญพลังงาน ช่วยให้การทรงตัวดีขึ้น เคลื่อนไหว และทำกิจกรรมได้สะดวก คล่องตัวขึ้น'))
        elif all > 30:
            moreuan = st.error('-" อ้วนมากกก "- ')
            if moreuan:
                st.text_area('ขอแนะนำสำหรับคนที่อ้วนมาก:', ('1.ไม่กินอาหารตามใจ ไม่กินอาหารแก้เครียด ไม่กินจุบจิบ พยายามเลือกกินอาหารที่มีประโยชน์ ผัก - ผลไม้อ่อนหวาน เลือกข้าว - แป้งที่ขัดสีน้อย ธัญพืช เมล็ดพืช ถั่ว '
                                                            'สำหรับเนื้อสัตว์ เลือกเนื้อสัตว์ส่วนที่มีไขมันต่ำ เนื้อส่วนอก ไข่ไก่ หรือ เนื้อสัตว์ที่ให้ไขมันดีอย่างเนื้อปลา เป็นต้น'
                                                            '                                     2. ควรหมั่นเคลื่อนไหวร่างกาย ทำกิจวัตรประจำวันให้กระฉับกระเฉง ลุกขึ้นยืน เดินให้มาก และหากิจกรรมที่ช่วยให้ได้ขยับร่างกายมากขึ้น หากต้องการที่จะเริ่มการออกกำลังกาย ควรเข้ารับคำแนะนำจากแพทย์ '
                                                            'หรือผู้เชี่ยวชาญ เพื่อประเมินความพร้อมด้านสุขภาพ และร่างกาย เสียก่อน'
                                                            'เริ่มต้นออกกำลังกายด้วยกิจกรรมเบาๆ เหมาะสมกับสภาพร่างกาย โดยค่อยทำทีละน้อย แต่ทำอย่างสม่ำเสมอ เมื่อร่างกายแข็งแรงขึ้น จึงค่อยๆ ปรับโปรแกรมการออกกำลังกายให้เข้มข้นมากขึ้น '
                                                            'หรือ ใช้เวลาการออกกำลังกายให้นานขึ้น เลือกกิจกรรมการออกกำลังกายที่ปะทะน้อย แรงกระแทกต่ำ อย่างการเดิน การเดินในน้ำ ยืนแกว่งแขน หรือกิจกรรมที่ไม่หักโหมจนเกินไป '
                                                            'โดยพยายามตั้งเป้าหมายการออกกำลังกายให้ได้ 40 - 60 นาทีต่อวัน หรือจะแบ่งเป็นช่วงสั้นๆ ครั้งละ 10 - 20 นาที 2 - 3 ครั้งต่อวัน ก็ได้'
                                                            '                                                                '
                                                            '                                                                              '
                                                            '                   3. ควรฝึกความแข็งแรงของกล้ามเนื้อด้วยกิจกรรมเวทเทรนนิ่ง ที่ควบคุมโดยผู้เชี่ยวชาญ จะช่วยให้การฝึกปลอดภัย ถูกต้องและเหมาะสม เพื่อลดความเสี่ยงในการเกิดอุบัติเหตุ '
                                                            'และอาการบาดเจ็บได้ การฝึกควรทำอย่างค่อยเป็นค่อยไป ตามความแข็งแรงของร่างกาย ไม่ฝืน ไม่หักโหม และเมื่อน้ำหนักตัวลดลง กล้ามเนื้อ ร่างกายแข็งแรงขึ้น จึงค่อยปรับเปลี่ยนโปรแกรมการฝึก ให้เข้มข้น หรือใช้เวลาในการออกกำลังกายมากขึ้น'))

    tarang = col[0].button('ตารางค่าBMI')
    if tarang:
        st.image(
            'https://th.bing.com/th/id/R.3d2e5efe2415c058b7e0afff662b27fc?rik=Yih%2bz49f3UQ24A&riu=http%3a%2f%2f2.bp.blogspot.com%2f-3w3oveN1FpA%2fVOHdVQ9h5AI%2fAAAAAAAAFdA%2fJCHLV56PgFo%2fw1200-h630-p-k-no-nu%2fbmi.png&ehk=qbtIlI5HZKnd4iruuwZQ11XfUbOQ2sJrsG5oDzUL8qc%3d&risl=&pid=ImgRaw&r=0&sres=1&sresct=1',
            width=650)

#-------------- End tab2 ------------------------------------------------------------------------------------------------------------------------

with tab3:
    st.title('คำนวณค่า Calories ที่ควรรับประทานต่อวัน')

    st.image('Video/foodcal.jpg')
    st.markdown('##### พลังงานที่ทุกคนต้องการไม่เท่ากัน')
    st.markdown(
        '###### พลังงานที่ต้องการสำหรับแต่ละคนนั้นไม่เท่ากัน ดังนั้นการทราบค่าพลังงานที่ร่างกายเราต้องการจึงเป็นประโยชน์อย่างยิ่งในการช่วยควบคุมน้ำหนัก '
        'นอกจากการกินแล้วการออกกำลังกายก็สำคัญไม่แพ้กัน '
        'เพราะการออกกำลังกายคือการใช้พลังงานออกไป และช่วยเสริมสร้างกล้ามเนื้อ สุขภาพ และอารมณ์ให้ดียิ่งขึ้นด้วย')
    volume = st.columns(2)
    target_weight = volume[0].number_input('น้ำหนักของคุณ')
    colum = st.columns(3)
    load = colum[0].button('โหลดข้อมูลแคลอรี่')
    if load:
        st.write('กำลังโหลดข้อมูล...')
        df = pd.read_csv('Video/calorie.csv')
        st.write('"Success"')
        st.dataframe(df)
    train = colum[1].button('ฝึกประเมินแคลอรี่')
    if train:
        st.write('กำลังฝึกประเมินแคลอรี่')
        df = pd.read_csv('Video/calorie.csv')
        model = LinearRegression()
        model.fit(df[['Weight']], df['Calories'])
        st.write('"Success"')
        # คำนวณปริมาณแคลอรี่ที่ควรกินต่อวัน
    predict = colum[2].button('ประเมินแคลอรี่')
    if predict:
        df = pd.read_csv('Video/calorie.csv')
        model = LinearRegression()
        model.fit(df[['Weight']], df['Calories'])
        target_calories = model.predict([[target_weight]])[0]
        st.write(f"คุณควรได้รับปริมาณแคลอรี่ประมาณ {target_calories:.2f} กิโลแคลอรี่ต่อวัน")